<a href="https://colab.research.google.com/github/Ashiskumargit/Divine-AI-Data-Science/blob/main/Python/LOC_vs_ILOC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# importing pandas and numpy
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NaN, 'yellow', np.NaN, 'black', 'green', 'red']
})

# view the data
data

In [ ]:
data.loc[2:4,['age','city']]

In [ ]:
data.iloc[2:4,[0,2]]

In [ ]:
data.loc[data.age >= 15]

In [ ]:
# select with multiple conditions
data.loc[(data.age >= 12) & (data.gender == 'F')]

In [ ]:
#slice
data.loc[1:3]

In [ ]:
data.iloc[1:3]

In [ ]:
# select few columns with a condition
data.loc[(data.age >= 12), ['city','gender']]

In [ ]:
# update a column with condition
data.loc[(data.age >= 12) , 'section' ] = 'D'
data

In [ ]:
# update multiple columns with condition
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Ladakh']
data

In [ ]:
# select rows with indexes
data.iloc[[0,2,3]]

In [ ]:
# select rows with particular indexes and particular columns
data.iloc[[0,2,3],[1,4]]

In [ ]:
# select a range of rows
data.iloc[1:3]

In [ ]:
# select a range of rows and columns
data.iloc[1:3,2:4]

In [ ]:
# importing the module 
import pandas as pd

In [ ]:
# creating a sample dataframe 
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,   
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
   
# displaying the Dataframe
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [ ]:
# selecting cars with brand 'Maruti' and Mileage > 25 
display(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [ ]:
# selecting range of rows from 2 to 5 
display(data.loc[2 : 5])

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [ ]:
# updating values of Mileage if Year < 2015 
data.loc[(data.Year < 2015), ['Mileage']] = 22
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       22
1   Hyundai  2014       30000      Delhi       22
2      Tata  2011       60000     Mumbai       22
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       22
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       22
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [ ]:
# selecting 0th, 2th, 4th, and 7th index rows 
display(data.iloc[[0, 2, 4, 7]])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       22
2    Tata  2011       60000   Mumbai       22
4  Maruti  2012       10000   Mumbai       22
7    Tata  2018       15000  Chennai       21

In [ ]:
# selecting rows from 1 to 4 and columns from 2 to 4 
display(data.iloc[1 : 5, 2 : 5])

   Kms Driven    City  Mileage
1       30000   Delhi       22
2       60000  Mumbai       22
3       25000   Delhi       26
4       10000  Mumbai       22

In [ ]:
import numpy as np

In [ ]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])

In [ ]:
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [ ]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [ ]:
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [ ]:
s.iloc[:5]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
dtype: float64

In [ ]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [ ]:
display(df)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [ ]:
df.loc['Penelope']

In [ ]:
df.loc[['Cornelia', 'Jane', 'Dean']]

In [ ]:
df.loc['Aaron':'Dean']

In [ ]:
df.iloc[4]

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [ ]:
df.iloc[[2, -2]]

In [ ]:
df.iloc[:5:3]

In [ ]:
df.loc[['Jane', 'Dean'], 'height':]

In [ ]:
df.iloc[[1,4], 2]

In [ ]:
df.loc[:, 'color':'score':2]

In [ ]:
labels = ['Nick', 'Cornelia']
index_ints = [df.index.get_loc(label) for label in labels]
df.iloc[index_ints, [2, 4]]

In [ ]:
df.loc[df['age'] > 30, ['food', 'score']]

In [ ]:
df.iloc[(df['age'] > 30).values, [2, 4]]

In [ ]:
df.loc[:, 'color':'score':2]

In [ ]:
df['food']

In [ ]:
df[['food', 'score']]

In [ ]:
df['Penelope':'Christina'] # slice rows by label

In [ ]:
df[2:6:2] # slice rows by integer location